src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/denseAGFoam/fluidizedBed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (particles gas);

particles
{
    type            monodispersePhaseModel;
    residualAlpha   1e-6;
    diameterModel   constant;

    d               2.75e-4;
    alphaMax        0.62;
}

gas
{
    type            monodispersePhaseModel;
    residualAlpha   0;
    diameterModel   constant;
    d               1;
}

pMin    10000;

blending
{
    default
    {
        type            none;
        continuousPhase gas;
    }
}

sigma
(
    (particles and gas)   0
);

aspectRatio
(
);

drag
(
    (particles in gas)
    {
        type            SyamlalOBrien;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

turbulentDispersion
(
);

virtualMass
(
);

lift
(
);

wallLubrication
(
);

bubblePressure
(
);

heatTransfer
();
