src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/denseAGFoam/fluidizedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    boxToCell
    {
        box ( 0 0.4 -0.1 ) ( 0.5 2 0.1 );
        fieldValues
        (
            volScalarFieldValue alpha.particles     0
        );
    }
);

// ************************************************************************* //
